app/Views/master/mdestination_v.php

SELECT *
FROM `destination`
ORDER BY `destination_name` ASC
---
                                </thead>
                                <tbody>
                                    <?php
                                    $usr = $this->db
                                        ->table("destination")
                                        ->orderBy("destination_name", "ASC")
                                        ->get();