app/Views/master/mvendor_v.php

SELECT *
FROM `vendor`
ORDER BY `vendor_name` ASC
---
                                </thead>
                                <tbody>
                                    <?php
                                    $usr = $this->db
                                        ->table("vendor")
                                        ->orderBy("vendor_name", "ASC")
                                        ->get();