app/Views/template/header_v.php

SELECT *
FROM `identity`
---
}
$icon = "";
$nama = "";
$identity = $this->db->table("identity")->get();