app/Models/login_m.php

SELECT *
FROM `identity`
SELECT *
FROM `user`
LEFT JOIN `position` ON `position`.`position_id`=`user`.`position_id`
WHERE `user_nik` = 'admin'
---
    public function index()
    {
        //require_once("meta_m.php");
        $data = array();
        $data["message"] = "";
        $data["hasil"] = "";
        $data['masuk'] = 0;


        $identity = $this->db->table("identity")->get()->getRow();
        // dd($identity->identity_twitter);

        if (isset($_POST["user_nik"]) && isset($_POST["password"])) {
            $builder = $this->db->table("user")
                ->join("position", "position.position_id=user.position_id", "left")
                ->join("departemen", "departemen.departemen_id=user.departemen_id", "left")
                ->where("user_nik", $this->request->getVar("user_nik"));
            $user1 = $builder
                ->get();

SELECT *
FROM `positionpages`
LEFT JOIN `pages` ON `pages`.`pages_id`=`positionpages`.`pages_id`
WHERE `position_id` = '1'
---


                        //tambahkan modul di sini
                        $pages = $this->db->table("positionpages")
                            ->join("pages", "pages.pages_id=positionpages.pages_id", "left")
                            ->where("position_id", $user->position_id)
                            ->get();