app/Views/login_v.php

SELECT *
FROM `identity`
---
$this->db = Database::connect("default");
$icon = "";
$nama = "";
$identity = $this->db->table("identity")->get();